직업과 나이, 성별 등에 대한 데이터가 data/occupations.csv에 있습니다.
각 직업의 평균 나이가 궁금한데요.
groupby 문법을 사용해서 '평균 나이'가 어린 순으로 직업을 나열해 보세요.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data/occupations_2.csv')
df

     age gender     occupation
0     24      M     technician
1     53      F          other
2     23      M         writer
3     24      M     technician
4     33      F          other
..   ...    ...            ...
938   26      F        student
939   32      M  administrator
940   20      M        student
941   48      F      librarian
942   22      M        student

[943 rows x 3 columns]

In [4]:
group = df.groupby('occupation')
group

In [5]:
group.count()

               age  gender
occupation
administrator   79      79
artist          28      28
doctor           7       7
educator        95      95
engineer        67      67
entertainment   18      18
executive       32      32
healthcare      16      16
homemaker        7       7
lawyer          12      12
librarian       51      51
marketing       26      26
none             9       9
other          105     105
programmer      66      66
retired         14      14
salesman        12      12
scientist       31      31
student        196     196
technician      27      27
writer          45      45

In [16]:
age_group = group['age'].mean(numeric_only=True)

In [20]:
age_group.sort_values()

occupation
student          22.081633
none             26.555556
entertainment    29.222222
artist           31.392857
homemaker        32.571429
programmer       33.121212
technician       33.148148
other            34.523810
scientist        35.548387
salesman         35.666667
writer           36.311111
engineer         36.388060
lawyer           36.750000
marketing        37.615385
executive        38.718750
administrator    38.746835
librarian        40.000000
healthcare       41.562500
educator         42.010526
doctor           43.571429
retired          63.071429
Name: age, dtype: float64

In [23]:
# 모범 답안
group.mean(numeric_only=True).sort_values(by='age')

                     age
occupation
student        22.081633
none           26.555556
entertainment  29.222222
artist         31.392857
homemaker      32.571429
programmer     33.121212
technician     33.148148
other          34.523810
scientist      35.548387
salesman       35.666667
writer         36.311111
engineer       36.388060
lawyer         36.750000
marketing      37.615385
executive      38.718750
administrator  38.746835
librarian      40.000000
healthcare     41.562500
educator       42.010526
doctor         43.571429
retired        63.071429